#include <iostream>

/*
题目要求：
采用命题逻辑判断题目结果。
命题：
（1）营业员A或B偷了手表； 
（2）若A作案，则作案不在营业时间； 
（3）若B提供的证据正确，则货柜未上锁； 
（4）若B提供的证据不正确，则作案发生在营业时间； 
（5）货柜上了锁。

符号化命题：
A:营业员A偷了手表
B:营业员B偷了手表
C:作案不在营业时间
D:B提供的证据正确
E:货柜未上锁
*/

int main()
{
	int A, B, C, D, E;
    //A.B.C.D.E共有两个取值0，1代表命题为假或真
	for (A = 0;A <= 1;A++)
		for (B = 0;B <= 1;B++)
			for (C = 0;C <= 1;C++)
				for (D = 0;D <= 1;D++)
					for (E = 0;E <= 1;E++)
                        //当当前表达式满足题目命题符合命题要求，输出当前A、B的值，判断谁偷了手表
						if ((A || B) && (!A || C) && (!D || E) && (D || !C) && !E)
							std::cout << "A=" << A << "," << "B=" << B<<std::endl;
	return 0;
}
